#pandas

In [1]:
import pandas as pd

In [2]:
print(pd. __version__)

1.3.2

In [3]:
arr =[0,1,2,3,4]
s1= pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [4]:
order=[1,2,3,4,5]
pd.Series(arr, index=order)

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [5]:
import numpy as np
n=np.random.randn(5)
index =['a','b','c','d','e']
s2 =pd.Series(n, index=index)
s2

a    0.155481
b    0.017341
c    1.365899
d   -0.212579
e    0.180281
dtype: float64

In [6]:
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [7]:
s1.index=['A','B','C','D','E']
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [8]:
s1[:2]

A    0
B    1
dtype: int64

In [9]:
s4=s1.append(s1)
s4

A    0
B    1
C    2
D    3
E    4
A    0
B    1
C    2
D    3
E    4
dtype: int64

In [10]:
s4.drop('E')

A    0
B    1
C    2
D    3
A    0
B    1
C    2
D    3
dtype: int64

SERIES OPERATIONS

In [11]:
arr1=[1,2,3,4,5,7]
arr2=[6,7,8,9,5]

In [12]:
s5=pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [13]:
s6=pd.Series(arr1)
s6

0    1
1    2
2    3
3    4
4    5
5    7
dtype: int64

In [14]:
s5.add(s6)

0     7.0
1     9.0
2    11.0
3    13.0
4    10.0
5     NaN
dtype: float64

In [15]:
s5.sub(s6)

0    5.0
1    5.0
2    5.0
3    5.0
4    0.0
5    NaN
dtype: float64

In [16]:
s5.mul(s6)

0     6.0
1    14.0
2    24.0
3    36.0
4    25.0
5     NaN
dtype: float64

In [17]:
s5.div(s6)

0    6.000000
1    3.500000
2    2.666667
3    2.250000
4    1.000000
5         NaN
dtype: float64

In [18]:
s6.median()

3.5

In [19]:
print("max",s6.max())

max 7

CREATING DATAFRAME

In [20]:
dates=pd.date_range('today',periods=6)
num_arr=np.random.randn(6,4)
columns=['A','B','C','D']
df1=pd.DataFrame(num_arr,index=dates, columns=columns)

df1

                                   A         B         C         D
2021-09-23 13:15:13.978718 -0.874349  0.008403  0.728965  0.782906
2021-09-24 13:15:13.978718  0.268597  0.985078  0.048878 -0.342752
2021-09-25 13:15:13.978718  0.377973  1.928581 -0.290180 -0.227852
2021-09-26 13:15:13.978718  1.830269 -1.972441  1.145906  0.827699
2021-09-27 13:15:13.978718 -0.559633  0.853994  0.847952  1.499244
2021-09-28 13:15:13.978718 -0.240014 -1.540929 -0.650111 -2.628461

In [21]:
data = {'animals' :['cat','paka'],
       'height': [10,20]}
labels=['a','b']

df2=pd.DataFrame(data, index=labels)
df2

  animals  height
a     cat      10
b    paka      20

In [22]:
df2.dtypes

animals    object
height      int64
dtype: object

In [23]:
df2.head(1)

  animals  height
a     cat      10

In [24]:
df3.columns

NameError: name 'df3' is not defined

In [ ]:
df2.values

In [25]:
df2.describe()

          height
count   2.000000
mean   15.000000
std     7.071068
min    10.000000
25%    12.500000
50%    15.000000
75%    17.500000
max    20.000000

In [26]:
df2.to_csv("dta.csv")

In [27]:
df2.T

           a     b
animals  cat  paka
height    10    20

In [28]:
df2.shape

(2, 2)

In [29]:
df2.sort_values(by='height')

  animals  height
a     cat      10
b    paka      20

In [30]:
df2[1:2]

  animals  height
b    paka      20

In [33]:
df2.iloc[0:1]

  animals  height
a     cat      10